{
    "Abstract": "In today’s fast-paced society, fewer users tend to read user manuals. Instead, they are increas-\ningly inclined to graphical, easy-to-navigate, and quick instructions. In the domain of automo-\ntive assistance, the lack of knowledge of the typical user, coupled with the seeming difficulty\nof straightforward procedures, encourages them to seek the help of a specialist. Augmented\nReality (AR) replaces paper-based manuals by overlaying computer-generated graphical in-\nstructions in the real environment. Computer Vision (CV) techniques and Machine Learning\n(ML) models can be utilized for car component feature detection and repair instructions. The\nproposed system is an AR-based application that shall be accessible on mobile phones, tablets,\nand wearable devices. The application aims to guide average-skilled users through standard\nmaintenance procedures and aid them in getting acquainted with their vehicle’s features.",
    "1.3 Business Context": "In the United States alone, new car sales in 2022 are estimated to reach 15.47 million new vehicles,\naccording to [1]. All these cars are expected to undergo routine maintenance and have their fea-\ntures illustrated by the manufacturer. In [2], it is highlighted that AR can reinvent how the industry\ncommunicates with the end buyer, resulting in a new marketing strategy that is very convincing.\nInstead of using paper-based manuals, companies may utilise augmented reality (AR) to help buy-\ners understand the car’s features, as illustrated in [3]. Not only will it benefit potential buyers, but\nexisting customers who wish to save time and money and do their own basic maintenance tasks,\nwill greatly benefit from such a system.",
    "3.1 Problem Statement": "In theory, owning a car provides autonomy and freedom as opposed to public transportation. How-\never, car owners usually receive little to no initiation to their vehicle’s standard maintenance pro-\ncedures and features. Consequently, they show an inclination to pay a visit to a professional even\nfor low-difficulty challenges they face, ranging from not understanding the signs on the dashboard\nto changing one of the car fuses. The traditional solution to this issue is to read the car manual\nprovided by the manufacturer in a paper-based or pdf format. Nevertheless, most users show no\ninterest in skimming through a large document to solve their problem. That is why, an AR ap-\nplication that superimposes information and maintenance procedure instructions graphically on\nthe real-environment, constitutes a modern user-friendly alternative. This application would also\nencourage user independence and ease of access to information.",
    "3.3 System Scope": "The system shall address the following:\n• The system shall devise a markerless-based AR system to display detailed instructions for\ncar assistance tasks.\n9\n• The system shall utilize machine learning models and computer vision techniques for car\ncomponents detection and recognition.\n• The system shall overlay the guiding instructions to assist car owners in maintaining their\ncars and getting acquainted with their cars’ features.\n• The system shall include procedures that ensures car owners’ safety, that is the system will\nnot incorporate hazardous procedures.\n• The system shall be able to connect car owners to an expert at the headquarters for assistance.\n• The system shall offer complementary services for car owners such as finding nearby main-\ntenance centers.\n• The system shall be compatible with different hand-held devices.",
    "3.4 Objectives": "• To develop a user-friendly application that is accessible through mobile devices and tablets\nto assist average-skilled car owners to easily follow the instructions for their vehicle mainte-\nnance.\n• To allow the detection and recognition of the different car parts, whether under-hood com-\nponents or car dashboard triggers.\n• To overlay detailed instructions over the car parts, in the real scene, to perform a task. In-\nstructions can be textual, pictorial, or animated 3D models.\n11\n• To display warnings to car owners, during a procedure, to prevent them from executing the\nprocedure incorrectly.\n• To offer a tele-assistance feature for the car owners to get assistance from a remote expert.\n• To offer complementary car support features to car owners including list of nearby main-\ntenance centers, reminders for car maintenance procedures, and maintenance checklist for\nroad trips.\n• To auto-generate detailed report after each car maintenance procedure."
}